In [1]:
pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-8.3.0-cp311-cp311-macosx_13_0_arm64.whl (15.3 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 15.3/15.3 MB 17.7 MB/s eta 0:00:0000:0100:01
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.3.0

[notice] A new release of pip is available: 23.1.2 -> 24.0
[notice] To update, run: pip3 install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [1]:
import mysql.connector 

mydb=mysql.connector.connect(
    host='localhost',
    user='root',
    password='Thushin@2001',
    
)

a=mydb.cursor()

a.execute("SHOW DATABASES")

for x in a:
    print(x)

('employee',)
('information_schema',)
('mysql',)
('newdatabase',)
('performance_schema',)
('sys',)

In [ ]:
a=mydb.cursor()

a.execute("create database newdatabase")

for x in a:
    print(x)

In [2]:
mydb=mysql.connector.connect(
    host='localhost',
    user='root',
    password='Thushin@2001',
    database='newdatabase'
)
a=mydb.cursor()

# a.execute("create table customer(id int, name varchar(50),address varchar(50))")

# for x in a:
#     print(x)

In [ ]:
a=mydb.cursor()

a.execute("alter table customer add column(salary int)")

for x in a:
    print(x)

In [15]:
a=mydb.cursor()

a.execute("alter table customer modify id int not null")

for x in a:
    print(x)

In [ ]:
a=mydb.cursor()

a.execute("describe customer")

for x in a:
    print(x)

In [31]:
a=mydb.cursor()

a.execute("insert into customer values(100,'athul','kozhikode',25000),(101,'abi','kannur',30000)")
mydb.commit()
for x in a:
    print(x)

In [58]:
a=mydb.cursor()

a.execute("select * from customer")

myresult=a.fetchall()

for x in myresult:
    print(x)

(100, 'athul', 'kozhikode', 25000)
(101, 'abi', 'kannur', 30000)
(100, 'athul', 'kozhikode', 25000)
(101, 'abi', 'kannur', 30000)

In [44]:
a=mydb.cursor()

a.execute("select * from customer")

myresult=a.fetchone()

print(myresult)

(100, 'athul', 'kozhikode', 25000)

In [64]:


sql= "insert into customer (id,name,address,salary) values(%s,%s,%s,%s)"
val=[(102,'arun','wayanad',20000),
     (103,'anu','kannur',22000),
     (104,'atif','kochi',35000)
     ]

a.executemany(sql,val)
mydb.commit()

print(a.rowcount)

3

In [75]:


a.execute("select * from customer where address='kannur'")

for x in a:
    print(x)

(101, 'abi', 'kannur', 30000)
(101, 'abi', 'kannur', 30000)
(103, 'anu', 'kannur', 22000)
(103, 'anu', 'kannur', 22000)
(103, 'anu', 'kannur', 22000)

In [76]:
a.execute("select * from customer where address='kannur' and id=101")

for x in a:
    print(x)

(101, 'abi', 'kannur', 30000)
(101, 'abi', 'kannur', 30000)

In [78]:
a.execute("select * from customer where address like '%nn%'")

for x in a:
    print(x)

(101, 'abi', 'kannur', 30000)
(101, 'abi', 'kannur', 30000)
(103, 'anu', 'kannur', 22000)
(103, 'anu', 'kannur', 22000)
(103, 'anu', 'kannur', 22000)

In [81]:
a.execute('select distinct * from customer')
mydb.commit
for x in a:
    print(x)

(100, 'athul', 'kozhikode', 25000)
(101, 'abi', 'kannur', 30000)
(102, 'arun', 'wayanad', 20000)
(103, 'anu', 'kannur', 22000)
(104, 'atif', 'kochi', 35000)

In [5]:
a.execute("select * from customer")

for x in a:
    print(x)

In [4]:
a.execute('delete from customer')
mydb.commit()
for x in a:
    print(x)

In [7]:
a.execute("create table new(name varchar(50))")

for x in a:
    print(x)

In [10]:
a.execute("drop table new")

for x in a:
    print(x)

In [11]:
a.execute("show tables")

for x in a:
    print(x)

('customer',)

In [12]:
sql= "insert into customer (id,name,address,salary) values(%s,%s,%s,%s)"
val=[(100,'athul','kozhikode',25000),
     (101,'abi','kannur',30000),
     (102,'arun','wayanad',20000),
     (103,'anu','kannur',22000),
     (104,'atif','kochi',35000)
     ]

a.executemany(sql,val)
mydb.commit()

for x in a:
    print(x)

In [13]:
a.execute("select * from customer")

for x in a:
    print(x)

(100, 'athul', 'kozhikode', 25000)
(101, 'abi', 'kannur', 30000)
(102, 'arun', 'wayanad', 20000)
(103, 'anu', 'kannur', 22000)
(104, 'atif', 'kochi', 35000)

In [14]:
a.execute("update customer set address='kozhikode' where name='abi'")

In [16]:
a.execute("select * from customer limit 3")

for x in a:
    print(x)

(100, 'athul', 'kozhikode', 25000)
(101, 'abi', 'kozhikode', 30000)
(102, 'arun', 'wayanad', 20000)

In [ ]:
a.execute("select * from customer limit 3")

for x in a:
    print(x)

In [17]:
mydb=mysql.connector.connect(
    host='localhost',
    user='root',
    password='Thushin@2001',
    database='employee'
)
a=mydb.cursor()

In [18]:
a.execute("select * from emptable")

for x in a:
    print(x)

(100, 'abi', 'kozhikode', 200000)
(101, 'athul', 'kozhikode', 300000)
(102, 'anu', 'kannur', 200000)
(104, 'sachin', 'wayanad', 230000)
(105, 'abdu', 'wayanad', 330000)

In [19]:
a.execute("select * from emp")

for x in a:
    print(x)

(100, 'abi', 20, 'kozhikode')
(101, 'athul', 21, 'kozhikode')
(102, 'anu', 21, 'kannur')
(103, 'manu', 19, 'kannur')
(104, 'sachin', 20, 'wayanad')

In [20]:
a.execute("select * from emptable left outer join emp on emptable.emp_name=emp.emp_name")

for x in a:
    print(x)

(100, 'abi', 'kozhikode', 200000, 100, 'abi', 20, 'kozhikode')
(101, 'athul', 'kozhikode', 300000, 101, 'athul', 21, 'kozhikode')
(102, 'anu', 'kannur', 200000, 102, 'anu', 21, 'kannur')
(104, 'sachin', 'wayanad', 230000, 104, 'sachin', 20, 'wayanad')
(105, 'abdu', 'wayanad', 330000, None, None, None, None)

In [21]:
a.execute("select * from emptable inner join emp on emptable.emp_name=emp.emp_name")

for x in a:
    print(x)

(100, 'abi', 'kozhikode', 200000, 100, 'abi', 20, 'kozhikode')
(101, 'athul', 'kozhikode', 300000, 101, 'athul', 21, 'kozhikode')
(102, 'anu', 'kannur', 200000, 102, 'anu', 21, 'kannur')
(104, 'sachin', 'wayanad', 230000, 104, 'sachin', 20, 'wayanad')

In [22]:
a.execute("select * from emptable right outer join emp on emptable.emp_name=emp.emp_name")

for x in a:
    print(x)

(100, 'abi', 'kozhikode', 200000, 100, 'abi', 20, 'kozhikode')
(101, 'athul', 'kozhikode', 300000, 101, 'athul', 21, 'kozhikode')
(102, 'anu', 'kannur', 200000, 102, 'anu', 21, 'kannur')
(None, None, None, None, 103, 'manu', 19, 'kannur')
(104, 'sachin', 'wayanad', 230000, 104, 'sachin', 20, 'wayanad')